In [276]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [277]:
data=pd.read_excel("Data_Train.xlsx")

In [278]:
#!pip install xlrd

In [279]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [280]:
#data[pd.isnull(data["Power"])]

In [281]:
data.shape

(6019, 13)

In [282]:
data.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  42
New_Price            5195
Price                   0
dtype: int64

In [283]:
x=data["Name"][1].split(" ")[0:2]

In [284]:
def gett(x):
    return(x[0]+x[1])

In [285]:
gett(x)

'HyundaiCreta'

In [286]:
data["Name"]=data["Name"].apply(lambda x :x.split(" "))
data["Name"]=data["Name"].apply(lambda x : gett(x))

In [287]:
data["how_old"]=data["Year"].apply(lambda x: 2019-x)

In [288]:
data.drop(labels="New_Price",axis=1,inplace=True)

In [289]:
data[pd.isnull(data["Mileage"])]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,how_old
4446,MahindraE,Chennai,2016,50000,Electric,Automatic,First,NaN,72 CC,41 bhp,5.0,13.00,3
4904,ToyotaPrius,Mumbai,2011,44000,Electric,Automatic,First,NaN,1798 CC,73 bhp,5.0,12.75,8

In [290]:
data["Seats"].value_counts()

5.0     5014
7.0      674
8.0      134
4.0       99
6.0       31
2.0       16
10.0       5
9.0        3
0.0        1
Name: Seats, dtype: int64

In [291]:
#data[pd.isnull(data["Seats"])]

In [292]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,how_old
0,MarutiWagon,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,9
1,HyundaiCreta,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,4
2,HondaJazz,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,8
3,MarutiErtiga,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,7
4,AudiA4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,6

In [293]:
setnull=data[["Fuel_Type","Power","Transmission","Mileage","Engine","Seats","Price"]]

In [294]:
setnull.head()

  Fuel_Type      Power Transmission     Mileage   Engine  Seats  Price
0       CNG  58.16 bhp       Manual  26.6 km/kg   998 CC    5.0   1.75
1    Diesel  126.2 bhp       Manual  19.67 kmpl  1582 CC    5.0  12.50
2    Petrol   88.7 bhp       Manual   18.2 kmpl  1199 CC    5.0   4.50
3    Diesel  88.76 bhp       Manual  20.77 kmpl  1248 CC    7.0   6.00
4    Diesel  140.8 bhp    Automatic   15.2 kmpl  1968 CC    5.0  17.74

In [295]:
a="26.65h"
a[0:4]

'26.6'

In [296]:
setnull["Mileage"]=setnull["Mileage"].astype("str")

In [297]:
setnull["Mileage"]=setnull["Mileage"].apply(lambda x : x[0:4])

In [298]:
setnull["Engine"]=setnull["Engine"].astype("str")

In [299]:
setnull["Engine"]=setnull["Engine"].apply(lambda x : x.replace("CC",""))

In [300]:
setnull["Power"]=setnull["Power"].astype("str")

In [301]:
setnull["Power"]=setnull["Power"].apply(lambda x : x.replace("bhp",""))

In [302]:
setnull[75:79]

   Fuel_Type    Power Transmission Mileage Engine  Seats  Price
75    Diesel  187.74     Automatic    18.5  1968     5.0  29.50
76    Diesel    null        Manual    17.8  1399     5.0   2.00
77    Petrol     132        Manual    12.4  1998     8.0   4.50
78    Diesel     102        Manual    12.8  2494     7.0  11.75

In [303]:
setnull["Power"]=setnull["Power"].replace("null ",np.NaN)

In [304]:
from sklearn.preprocessing import LabelEncoder

In [305]:
le1=LabelEncoder()
le2=LabelEncoder()

In [306]:
setnull["Fuel_Type"]=le1.fit_transform(setnull["Fuel_Type"])
setnull["Transmission"]=le2.fit_transform(setnull["Transmission"])

In [307]:
#!pip install fancyimpute
setnull["Mileage"]=setnull["Mileage"].astype("float")
setnull["Engine"]=setnull["Engine"].astype("float")
setnull["Power"]=setnull["Power"].astype("float")

In [308]:
from fancyimpute import KNN
X_filles= KNN(k=7).fit_transform(setnull)

Imputing row 1/6019 with 0 missing, elapsed time: 6.136
Imputing row 101/6019 with 0 missing, elapsed time: 6.137
Imputing row 201/6019 with 0 missing, elapsed time: 6.138
Imputing row 301/6019 with 0 missing, elapsed time: 6.139
Imputing row 401/6019 with 0 missing, elapsed time: 6.140
Imputing row 501/6019 with 0 missing, elapsed time: 6.141
Imputing row 601/6019 with 0 missing, elapsed time: 6.142
Imputing row 701/6019 with 0 missing, elapsed time: 6.143
Imputing row 801/6019 with 0 missing, elapsed time: 6.144
Imputing row 901/6019 with 0 missing, elapsed time: 6.145
Imputing row 1001/6019 with 0 missing, elapsed time: 6.146
Imputing row 1101/6019 with 0 missing, elapsed time: 6.147
Imputing row 1201/6019 with 0 missing, elapsed time: 6.147
Imputing row 1301/6019 with 0 missing, elapsed time: 6.148
Imputing row 1401/6019 with 0 missing, elapsed time: 6.149
Imputing row 1501/6019 with 0 missing, elapsed time: 6.150
Imputing row 1601/6019 with 0 missing, elapsed time: 6.151
Imputing row 1701/6019 with 0 missing, elapsed time: 6.152
Imputing row 1801/6019 with 0 missing, elapsed time: 6.152
Imputing row 1901/6019 with 0 missing, elapsed time: 6.153
Imputing row 2001/6019 with 0 missing, elapsed time: 6.154
Imputing row 2101/6019 with 0 missing, elapsed time: 6.155
Imputing row 2201/6019 with 0 missing, elapsed time: 6.156
Imputing row 2301/6019 with 0 missing, elapsed time: 6.157
Imputing row 2401/6019 with 0 missing, elapsed time: 6.158
Imputing row 2501/6019 with 0 missing, elapsed time: 6.159
Imputing row 2601/6019 with 0 missing, elapsed time: 6.160
Imputing row 2701/6019 with 0 missing, elapsed time: 6.161
Imputing row 2801/6019 with 0 missing, elapsed time: 6.163
Imputing row 2901/6019 with 0 missing, elapsed time: 6.164
Imputing row 3001/6019 with 0 missing, elapsed time: 6.164
Imputing row 3101/6019 with 0 missing, elapsed time: 6.165
Imputing row 3201/6019 with 0 missing, elapsed time: 6.166
Imputing row 3301/6019 with 0 missing, elapsed time: 6.167
Imputing row 3401/6019 with 0 missing, elapsed time: 6.168
Imputing row 3501/6019 with 0 missing, elapsed time: 6.168
Imputing row 3601/6019 with 0 missing, elapsed time: 6.169
Imputing row 3701/6019 with 0 missing, elapsed time: 6.170
Imputing row 3801/6019 with 2 missing, elapsed time: 6.171
Imputing row 3901/6019 with 0 missing, elapsed time: 6.172
Imputing row 4001/6019 with 0 missing, elapsed time: 6.173
Imputing row 4101/6019 with 0 missing, elapsed time: 6.173
Imputing row 4201/6019 with 0 missing, elapsed time: 6.174
Imputing row 4301/6019 with 0 missing, elapsed time: 6.175
Imputing row 4401/6019 with 0 missing, elapsed time: 6.176
Imputing row 4501/6019 with 0 missing, elapsed time: 6.177
Imputing row 4601/6019 with 0 missing, elapsed time: 6.177
Imputing row 4701/6019 with 0 missing, elapsed time: 6.178
Imputing row 4801/6019 with 0 missing, elapsed time: 6.179
Imputing row 4901/6019 with 1 missing, elapsed time: 6.179
Imputing row 5001/6019 with 0 missing, elapsed time: 6.180
Imputing row 5101/6019 with 0 missing, elapsed time: 6.181
Imputing row 5201/6019 with 0 missing, elapsed time: 6.182
Imputing row 5301/6019 with 0 missing, elapsed time: 6.182
Imputing row 5401/6019 with 0 missing, elapsed time: 6.183
Imputing row 5501/6019 with 0 missing, elapsed time: 6.183
Imputing row 5601/6019 with 0 missing, elapsed time: 6.185
Imputing row 5701/6019 with 0 missing, elapsed time: 6.185
Imputing row 5801/6019 with 0 missing, elapsed time: 6.186
Imputing row 5901/6019 with 0 missing, elapsed time: 6.187
Imputing row 6001/6019 with 0 missing, elapsed time: 6.188

In [309]:
sett=pd.DataFrame(X_filles)

In [310]:
sett.columns=setnull.columns

In [311]:
sett.isnull().sum()

Fuel_Type       0
Power           0
Transmission    0
Mileage         0
Engine          0
Seats           0
Price           0
dtype: int64

In [312]:
data.shape

(6019, 13)

In [313]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,how_old
0,MarutiWagon,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,9
1,HyundaiCreta,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,4
2,HondaJazz,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,8
3,MarutiErtiga,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,7
4,AudiA4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,6

In [314]:
df1=pd.concat([data.drop(["Fuel_Type","Power","Seats","Transmission","Mileage","Engine","Price"],1),sett],axis=1)

In [315]:
df1.head()

,Name,Location,Year,Kilometers_Driven,Owner_Type,how_old,Fuel_Type,Power,Transmission,Mileage,Engine,Seats,Price
0,MarutiWagon,Mumbai,2010,72000,First,9,0.0,58.16,1.0,26.6,998.0,5.0,1.75
1,HyundaiCreta,Pune,2015,41000,First,4,1.0,126.20,1.0,19.6,1582.0,5.0,12.50
2,HondaJazz,Chennai,2011,46000,First,8,4.0,88.70,1.0,18.2,1199.0,5.0,4.50
3,MarutiErtiga,Chennai,2012,87000,First,7,1.0,88.76,1.0,20.7,1248.0,7.0,6.00
4,AudiA4,Coimbatore,2013,40670,Second,6,1.0,140.80,0.0,15.2,1968.0,5.0,17.74

In [316]:
df1["Fuel_Type"]=df1["Fuel_Type"].astype("int")

In [318]:
df1["Fuel_Type"]=le1.inverse_transform(df1["Fuel_Type"])

In [319]:
df1["Transmission"]=df1["Transmission"].astype("int")

In [320]:
df1["Transmission"]=le2.inverse_transform(df1["Transmission"])

In [321]:
df1.isnull().sum()

Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Owner_Type           0
how_old              0
Fuel_Type            0
Power                0
Transmission         0
Mileage              0
Engine               0
Seats                0
Price                0
dtype: int64

In [322]:
df1.head()

,Name,Location,Year,Kilometers_Driven,Owner_Type,how_old,Fuel_Type,Power,Transmission,Mileage,Engine,Seats,Price
0,MarutiWagon,Mumbai,2010,72000,First,9,CNG,58.16,Manual,26.6,998.0,5.0,1.75
1,HyundaiCreta,Pune,2015,41000,First,4,Diesel,126.20,Manual,19.6,1582.0,5.0,12.50
2,HondaJazz,Chennai,2011,46000,First,8,Petrol,88.70,Manual,18.2,1199.0,5.0,4.50
3,MarutiErtiga,Chennai,2012,87000,First,7,Diesel,88.76,Manual,20.7,1248.0,7.0,6.00
4,AudiA4,Coimbatore,2013,40670,Second,6,Diesel,140.80,Automatic,15.2,1968.0,5.0,17.74